20240202152410-integrals.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-07 Wed 23:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Integrals</title>
<meta name="author" content="Will McDonald" />
<meta name="description" content="Calc AB Integrals" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="~/Documents/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="~/Documents/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Integrals</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org814ab4a">1. Properties of Derivatives</a>
<ul>
<li><a href="#orgd33e0f4">1.1. Sum/Difference Property</a></li>
<li><a href="#org63ddc5f">1.2. Constant Multiple Property</a></li>
<li><a href="#orga20fa7f">1.3. Reverse Interval</a></li>
<li><a href="#org2858dc1">1.4. Zero Length Interval</a></li>
<li><a href="#org0eb28dd">1.5. Adding Interval</a></li>
</ul>
</li>
<li><a href="#org2f61334">2. Solving Integrals</a>
<ul>
<li><a href="#org688a9f6">2.1. Approximations</a>
<ul>
<li><a href="#org6b22ca7">2.1.1. Riemann Sums</a></li>
<li><a href="#org51f247b">2.1.2. Trapazoidal</a></li>
</ul>
</li>
<li><a href="#org6e68a01">2.2. Exact Solutions</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org814ab4a" class="outline-2">
<h2 id="org814ab4a"><span class="section-number-2">1.</span> Properties of Derivatives</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd33e0f4" class="outline-3">
<h3 id="orgd33e0f4"><span class="section-number-3">1.1.</span> Sum/Difference Property</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The integral of two functions added or subtracted from each other is the same as the sum or difference of the integral of each function:
\[ \int_{a}^{b}(f(x) \pm g(x))\,dx = \int_{a}^{b}f(x)\,dx \pm \int_{a}^{b}g(x)\,dx\]
</p>
</div>
</div>
<div id="outline-container-org63ddc5f" class="outline-3">
<h3 id="org63ddc5f"><span class="section-number-3">1.2.</span> Constant Multiple Property</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The integral of a function times constant k, is the same as constant k times the integral of a function:
\[\int_{a}^{b}k*f(x)\,dx = k * \int_{a}^{b}f(x)\, dx\]
</p>
</div>
</div>
<div id="outline-container-orga20fa7f" class="outline-3">
<h3 id="orga20fa7f"><span class="section-number-3">1.3.</span> Reverse Interval</h3>
<div class="outline-text-3" id="text-1-3">
<p>
An integral from range a to b will be the same, but opposite of an integral that goes from b to a:
\[\int_a^b f(x)dx=-\int_b^a f(x)dx \]
</p>
</div>
</div>
<div id="outline-container-org2858dc1" class="outline-3">
<h3 id="org2858dc1"><span class="section-number-3">1.4.</span> Zero Length Interval</h3>
<div class="outline-text-3" id="text-1-4">
<p>
An integral with a range of zero will be zero:
\[\int_a^a f(x)dx = 0 \]
</p>
</div>
</div>
<div id="outline-container-org0eb28dd" class="outline-3">
<h3 id="org0eb28dd"><span class="section-number-3">1.5.</span> Adding Interval</h3>
<div class="outline-text-3" id="text-1-5">
<p>
The sum of two integrals with the range a to b and b to c is equal to the integral from range a to c:
 \[\int_a^b f(x)dx+\int_b^c f(x)dx=\int_a^c f(x)dx \]
</p>
</div>
</div>
</div>
<div id="outline-container-org2f61334" class="outline-2">
<h2 id="org2f61334"><span class="section-number-2">2.</span> Solving Integrals</h2>
<div class="outline-text-2" id="text-2">
<p>
There are two kinds of approaches to solving integrals. Approximations and actually correct answers.
</p>
</div>
<div id="outline-container-org688a9f6" class="outline-3">
<h3 id="org688a9f6"><span class="section-number-3">2.1.</span> Approximations</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org6b22ca7" class="outline-4">
<h4 id="org6b22ca7"><span class="section-number-4">2.1.1.</span> <a href="20240202083535-riemann_sums.html#ID-6ec85437-df51-4884-9ca2-17d1b7f014a7">Riemann Sums</a></h4>
</div>
<div id="outline-container-org51f247b" class="outline-4">
<h4 id="org51f247b"><span class="section-number-4">2.1.2.</span> Trapazoidal</h4>
</div>
</div>
<div id="outline-container-org6e68a01" class="outline-3">
<h3 id="org6e68a01"><span class="section-number-3">2.2.</span> Exact Solutions</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-02-02</p>
<p class="author">Author: Will McDonald</p>
<p class="date">Created: 2024-02-07 Wed 23:12</p>
</div>
</body>
</html>
